---
kind: type
id: T:Autodesk.Revit.DB.SolidOptions
source: html/75d6caeb-62d1-d31f-47fe-618ac7cedf19.htm
---
# Autodesk.Revit.DB.SolidOptions

A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.

## Syntax (C#)
```csharp
public class SolidOptions : IDisposable
```